<?php
### NiunCMS - Community Management System ###
### Powered by Dead_Angel                 ###
### Лицензия: GNU/GPL v3                  ###
### Официальный сайт NiunCMS: www.niun.ru ###

if(!defined("NiunCMS")) die("Доступ запрещен");

function translit ($title)
{
$russimvol = array("а","А","б","Б","в","В","г","Г","д","Д","е","Е","ё","Ё","ж","Ж","з","З",
				   "и","И","й","Й","к","К","л","Л","м","М","н","Н","о","О","п","П","р","Р",
				   "с","С","т","Т","у","У","ф","Ф","х","Х","ц","Ц","ч","Ч","ш","Ш","щ","Щ",
				   "ы","Ы","э","Э","ю","Ю","я","Я","a","A","b","B","c","C","d","D","e","E",
				   "f","F","g","G","h","H","i","I","j","J","k","K","l","L","m","M","n","N",
				   "o","O","p","P","q","Q","r","R","s","S","t","T","u","U","v","V","w","W",
				   "x","X","y","Y","z","Z","1","2","3","4","5","6","7","8","9","0","-"," ");
$anglsimvol = array("a","a","b","b","v","v","g","g","d","d","e","e","yo","yo","zh","zh",
					"z","z","i","i","j","j","k","k","l","l","m","m","n","n","o","o","p","p",
					"r","r","s","s","t","t","u","u","ph","ph","h","h","c","c","ch","ch",
					"sh","sh","shh","shh","y","y","e","e","yu","yu","ya","ya","a","a",
					"b","b","c","c","d","d","e","e","f","f","g","g","h","h","i","i",
					"j","j","k","k","l","l","m","m","n","n","o","o","p","p","q","q",
					"r","r","s","s","t","t","u","u","v","v","w","w","x","x","y","y",
					"z","z","1","2","3","4","5","6","7","8","9","0","-","-");

$result = (!isset($result)) ? '' : $result;

for($i=0;isset($title[$i]);$i++)
{
	for($sim=0;$sim<=125;$sim++)//максимальное кол-во циклов равна 69. зависит от кол-ва символов в массиве
	{
		if($title[$i] == $russimvol[$sim])//если нашли овпадение символа в заголвке с символом в массиве
		{
			$result .= $anglsimvol[$sim];//сохраняем аналог найденого символа в отдельной переменной
			break;//завершаем цикл (второй for)
		}
	}
}
return $result;//выводим результат
}
?>